/*************************************************************************
    > File Name: 1170.c
    > Author: limbo
    > Mail: 468137306@qq.com
    > Created Time: 2013年12月03日 星期二 10时51分47秒
 ************************************************************************/

#include<stdio.h>
int main()
{
    int i,j,k,n,x,y,a[1000][2],temp;
    while(scanf("%d",&n) != EOF)
    {
        for(i = 0; i < n; i++)
        {
            scanf("%d %d",&a[i][0],&a[i][1]);
        }
        for(i = 0; i < n; i++)
            for(j = n - 1; j > i; j--)
            {
                if(a[j][0] < a[j - 1][0] ||(a[j][0] == a[j - 1][0] && a[j][1] < a[j - 1][1]))
                {
                    temp = a[j][0];a[j][0] = a[j - 1][0];a[j - 1][0] = temp;
                    temp = a[j][1];a[j][1] = a[j - 1][1];a[j - 1][1] = temp;
                }
            }
        printf("%d %d\n",a[0][0],a[0][1]);
    }
}
