/*************************************************************************
    > File Name: 1.c
    > Author: limbo
    > Mail: 468137306@qq.com
    > Created Time: 2013年11月29日 星期五 15时36分48秒
 ************************************************************************/

#include<stdio.h>
int main()
{
    char a[200],b[100];
    int i,j;
    while(scanf("%s %s",a,b) != EOF)
    {
        i = j = 0;
        while(a[i] != '\0') i++;
        while(b[j] != '\0') 
        {
            a[i] = b[j];
            i++;j++;
        }
        a[i] = '\0'; 
        printf("%s\n",a);
    }
}
